//獎金
myScoreArray=newArray(0,1000,2000,3000,4000,8000,10000,20000,30000,40000,60000,80000,150000,250000,500000,1000000,1100000);

//初級難度問題
quest1=newArray();
quest1[0]={A:"很節儉",B:"十分奢侈",C:"很樸素",D:"很知足",E:"B",F:"故事中的宰相一家人生活習慣如何?"};
quest1[1]={A:"不小心打翻食物",B:"因為飯不好吃",C:"因為浪費食物",D:"不小心煮太多",E:"C",F:"宰相家的廚房，為什麼常常流出大量的飯粒?"};
quest1[2]={A:"洗淨、儲藏起來",B:"不要管他",C:"給小狗吃",D:"當肥料",E:"A",F:"老和尚看到宰相浪費的飯粒，叫小和尚如何處理?"};
quest1[3]={A:"越來越謙虛",B:"更節儉",C:"更清廉",D:"越來越驕傲",E:"D",F:"這位宰相因為皇帝的寵愛信任，變得?"};
quest1[4]={A:"更富有",B:"一貧如洗",C:"更奢侈",D:"住得更豪華",E:"B",F:"宰相因犯罪被革職，家境變得?"};
quest1[5]={A:"幸災樂禍",B:"不理不睬",C:"把飯粒蒸熟送他們",D:"賣東西給他們",E:"C",F:"老和尚看到宰相一家人挨餓，就?"};

//高級難度問題
quest3=newArray();
quest3[0]={A:"很不屑",B:"不想吃",C:"很生氣",D:"非常感激",E:"D",F:"這位宰相得到老和尚送的飯時，心裡感覺如何?"};
quest3[1]={A:"很開心",B:"很驕傲",C:"很慚愧",D:"很生氣",E:"C",F:"這位宰相聽了老和尚的一番話，覺得?"};
quest3[2]={A:"過於節儉",B:"過於浪費",C:"過於樸素",D:"太過謙虛",E:"B",F:"宰相檢討自己過去的所作所為，發覺以前生活?"};
quest3[3]={A:"浪費",B:"謙虛",C:"節儉",D:"樸素",E:"A",F:"後來，宰相和家人改掉什麼壞習慣?"};
quest3[4]={A:"浪費食物",B:"珍惜食物",C:"挑食",D:"不知足",E:"B",F:"我們應該養成什麼好習慣?"};








