//獎金
myScoreArray =  new Array(0,1000,2000,3000,4000,8000,10000,20000,30000,40000,60000,80000,150000,250000,500000,1000000,1100000);

//初級難度問題
quest1 = new Array();
quest1[0]={A:"癌症",B:"感冒",C:"腸胃痛",D:"發燒",E:"A",F:"魏雪婷的母親生了什麼病?"};
quest1[1]={A:"小病",B:"很快就痊癒",C:"非常嚴重",D:"是小感冒",E:"C",F:"當病人住進安寧病房，表示病情如何?"};
quest1[2]={A:"豪華病房",B:"醫院準備的客廳",C:"家裡",D:"飯店",E:"B",F:"魏雪婷一家，照顧母親期間，都住在哪?"};
quest1[3]={A:"為了省錢",B:"因為吃太飽",C:"因為不好吃",D:"因為不愛吃",E:"A",F:"為什麼魏雪婷姐弟三個人只點一碗陽春麵?"};
quest1[4]={A:"因為吃太飽",B:"留給爸媽吃",C:"因為不好吃",D:"因為不愛吃",E:"B",F:"為什麼魏雪婷沒把麵吃完?"};
quest1[5]={A:"都留給自己",B:"跟弟弟平分",C:"全部分給媽媽和弟弟",D:"自己先吃一半",E:"C",F:"大哥冠宇每次分食物時，都把食物?"};

//高級難度問題
quest3 = new Array();
quest3[0]={A:"減肥",B:"那個便當太好吃了",C:"因為醫院沒賣便當",D:"因為沒錢買便當",E:"D",F:"魏雪婷一家，為什麼常常六個人吃一個便當?"};
quest3[1]={A:"冷淡",B:"疏離",C:"更加的體貼互助",D:"互相指責",E:"C",F:"魏雪婷一家人的感情，因貧窮、生病，而變的?"};
quest3[2]={A:"因為補習",B:"她放學後會先寫功課",C:"因為她很聰明",D:"因為她學過了",E:"B",F:"為什麼魏雪婷忙照顧母親，卻能兼顧功課?"};
quest3[3]={A:"應更加的體貼互助",B:"互相指責",C:"疏離",D:"冷淡",E:"A",F:"當家裡的還境不好時，應該如何對待家人?"};
quest3[4]={A:"浪費",B:"不知足",C:"知福惜福",D:"挑食",E:"C",F:"我們能有豐盛的營養午餐可以吃，應該?"};








