//獎金
myScoreArray=newArray(0,1000,2000,3000,4000,8000,10000,20000,30000,40000,60000,80000,150000,250000,500000,1000000,1100000);

//初級難度問題
quest1=newArray();
quest1[0]={A:"想要出名",B:"為了賺錢幫忙家計",C:"想要當歌星",D:"喜歡舞台",E:"B",F:"為什麼許芷菁要到處主持節目?"};
quest1[1]={A:"母親",B:"弟弟",C:"許芷菁",D:"妹妹",E:"C",F:"全家人中，誰最符合父親的換肝配對?"};
quest1[2]={A:"自己的婚姻",B:"看電視",C:"唱歌",D:"逛街",E:"A",F:"為了捐肝臟救父親，芷菁犧牲了什麼?"};
quest1[3]={A:"很痛苦",B:"很快樂",C:"很難過",D:"很奢侈",E:"B",F:"許芷菁家境不富裕，但一家人過得?"};
quest1[4]={A:"一直抱怨",B:"很生氣",C:"怨天尤人",D:"她都不嫌累",E:"D",F:""許芷菁工作很辛苦，她覺得如何?
""};
quest1[5]={A:"救了父親的命",B:"沒影響",C:"對父親沒幫助",D:"手術沒成功",E:"A",F:"肝臟移植手術後，對父親有什麼影響?"};

//高級難度問題
quest3=newArray();
quest3[0]={A:"裝飾",B:"送禮",C:"祝賀",D:"獎勵她的孝行",E:"D",F:"市長致贈孝行楷模匾額給許芷菁，是為了?"};
quest3[1]={A:"有趣",B:"不忍父親受病痛折磨",C:"好奇",D:"父親命令",E:"B",F:"許芷菁同意院方進行肝臟移植，是因為?"};
quest3[2]={A:"無怨無悔",B:"怨天尤人",C:"很後悔",D:"很生氣",E:"A",F:"許芷菁對於自己為了救父親而放棄婚姻，覺得?"};
quest3[3]={A:"忽視健康",B:"注意身體健康",C:"熬夜打電動",D:"熬夜看電視",E:"B",F:"健康是最大財富，我們應該?"};
quest3[4]={A:"熬夜",B:"挑食",C:"早睡早起，吃早餐",D:"不喝水",E:"C",F:"下列哪一個是有益健康的好習慣?"};
