//獎金
myScoreArray=newArray(0,1000,2000,3000,4000,8000,10000,20000,30000,40000,60000,80000,150000,250000,500000,1000000,1100000);

//初級難度問題
quest1=newArray();
quest1[0]={A:"健康良好",B:"眼睛幾乎看不到",C:"只有近視",D:"只有老花眼",E:"B",F:"薛主翔小朋友的父母健康情形如何?"};
quest1[1]={A:"一隻眼睛幾乎失明",B:"視力良好",C:"只有老花眼",D:"只有近視",E:"A",F:"主翔自己的健康情形如何?"};
quest1[2]={A:"很依賴",B:"很不懂事",C:"又懂事又獨立",D:"很不聽話",E:"C",F:"主翔小小年紀，有著什麼樣的個性?"};
quest1[3]={A:"照顧全家人",B:"依賴家人的保護",C:"要人家照顧牠",D:"喜歡命令別人",E:"A",F:"主翔像「光的小天使」守護全家人，指他能?"};
quest1[4]={A:"亂跑亂撞",B:"注意盲人的安全",C:"忽視別人安全",D:"不管別人感受",E:"B",F:"主翔很多次被機車輾到腳丫子痛得哭了，提醒我們應該?"};
quest1[5]={A:"三歲",B:"三十歲",C:"大學時",D:"高中時",E:"A",F:"主翔從幾歲開始就幫忙洗衣、掃地、整理房間?"};

//高級難度問題
quest3=newArray();
quest3[0]={A:"養小狗",B:"逛街",C:"學電腦",D:"煮菜",E:"C",F:"因為主翔會做家事，所以爸爸才能放心去做什麼事?"};
quest3[1]={A:"拿食物餵牠",B:"抱起來",C:"嚇牠",D:"不要干擾牠",E:"D",F:"路上看到導盲犬，應該?"};
quest3[2]={A:"沒有影響",B:"造成主人危險",C:"導盲犬不受影響",D:"有幫助",E:"B",F:"若野狗攻擊導盲犬，可能有什麼影響?"};
quest3[3]={A:"愛欺負人",B:"脾氣暴躁",C:"驕傲自大",D:"樂觀、勤勉好學",E:"D",F:"主翔個性如何?"};
quest3[4]={A:"多設計無障礙空間",B:"佔用殘障設施",C:"走路橫衝直撞",D:"忽視他人安全",E:"A",F:"要如何讓視障朋友有比較安全的環境?"};

